# AddInIdAttribute Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInIdAttribute Class
Members See Also
---
The custom AddInId attribute for Macros macros use only.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class AddInIdAttribute : Attribute
```

Visual Basic
---
```text
Public Class AddInIdAttribute _
	Inherits Attribute
```

Visual C++
---
```text
public ref class AddInIdAttribute : public Attribute
```

# Inheritance Hierarchy
System..::..Object System..::..Attribute Autodesk.Revit.DB.Macros..::..AddInIdAttribute
# See Also
AddInIdAttribute Members
Autodesk.Revit.DB.Macros Namespace